program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3404.23.1"}, {"coremltools-component-torch", "2.2.2"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios16>(tensor<fp32, [1, 3, 224, 224]> input_1) {
            tensor<fp32, []> input_1__scaled___y_0 = const()[name = tensor<string, []>("input_1__scaled___y_0"), val = tensor<fp32, []>(0x1.1c4bep-6)];
            tensor<fp32, [1, 3, 224, 224]> input_1__scaled__ = mul(x = input_1, y = input_1__scaled___y_0)[name = tensor<string, []>("input_1__scaled__")];
            tensor<fp32, [1, 3, 1, 1]> input_1__biased___y_0 = const()[name = tensor<string, []>("input_1__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1.0f177ap+1]], [[-0x1.04924ap+1]], [[-0x1.cdf012p+0]]]])];
            tensor<fp32, [1, 3, 224, 224]> input_1__biased__ = add(x = input_1__scaled__, y = input_1__biased___y_0)[name = tensor<string, []>("input_1__biased__")];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> input_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [32, 3, 3, 3]> const_61_to_fp16 = const()[name = tensor<string, []>("const_61_to_fp16"), val = tensor<fp16, [32, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> const_62_to_fp16 = const()[name = tensor<string, []>("const_62_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1856)))];
            tensor<fp16, [1, 3, 224, 224]> input_1_to_fp16 = cast(dtype = input_1_to_fp16_dtype_0, x = input_1__biased__)[name = tensor<string, []>("cast_66")];
            tensor<fp16, [1, 32, 112, 112]> input_3_cast_fp16 = conv(bias = const_62_to_fp16, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = const_61_to_fp16, x = input_1_to_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_mode_0 = const()[name = tensor<string, []>("input_5_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 32, 112, 112]> input_5_cast_fp16 = gelu(mode = input_5_mode_0, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 32, 3, 3]> const_63_to_fp16 = const()[name = tensor<string, []>("const_63_to_fp16"), val = tensor<fp16, [64, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1984)))];
            tensor<fp16, [64]> const_64_to_fp16 = const()[name = tensor<string, []>("const_64_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38912)))];
            tensor<fp16, [1, 64, 56, 56]> input_9_cast_fp16 = conv(bias = const_64_to_fp16, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = const_63_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 64, 1, 1]> const_65_to_fp16 = const()[name = tensor<string, []>("const_65_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39104)))];
            tensor<fp16, [256]> const_66_to_fp16 = const()[name = tensor<string, []>("const_66_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71936)))];
            tensor<fp16, [1, 256, 56, 56]> input_13_cast_fp16 = conv(bias = const_66_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = const_65_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> input_15_mode_0 = const()[name = tensor<string, []>("input_15_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 56, 56]> input_15_cast_fp16 = gelu(mode = input_15_mode_0, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_17_groups_0 = const()[name = tensor<string, []>("input_17_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [2]> input_17_strides_0 = const()[name = tensor<string, []>("input_17_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_17_dilations_0 = const()[name = tensor<string, []>("input_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [256, 1, 3, 3]> const_67_to_fp16 = const()[name = tensor<string, []>("const_67_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(72512)))];
            tensor<fp16, [256]> const_68_to_fp16 = const()[name = tensor<string, []>("const_68_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77184)))];
            tensor<fp16, [1, 256, 56, 56]> input_19_cast_fp16 = conv(bias = const_68_to_fp16, dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = const_67_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_mode_0 = const()[name = tensor<string, []>("input_21_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 56, 56]> input_21_cast_fp16 = gelu(mode = input_21_mode_0, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<string, []> input_23_pad_type_0 = const()[name = tensor<string, []>("input_23_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_23_strides_0 = const()[name = tensor<string, []>("input_23_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_23_pad_0 = const()[name = tensor<string, []>("input_23_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_23_dilations_0 = const()[name = tensor<string, []>("input_23_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_23_groups_0 = const()[name = tensor<string, []>("input_23_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 256, 1, 1]> const_69_to_fp16 = const()[name = tensor<string, []>("const_69_to_fp16"), val = tensor<fp16, [64, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77760)))];
            tensor<fp16, [64]> const_70_to_fp16 = const()[name = tensor<string, []>("const_70_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110592)))];
            tensor<fp16, [1, 64, 56, 56]> x_1_cast_fp16 = conv(bias = const_70_to_fp16, dilations = input_23_dilations_0, groups = input_23_groups_0, pad = input_23_pad_0, pad_type = input_23_pad_type_0, strides = input_23_strides_0, weight = const_69_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<fp16, [1, 64, 56, 56]> input_25_cast_fp16 = add(x = x_1_cast_fp16, y = input_9_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<string, []> input_27_mode_0 = const()[name = tensor<string, []>("input_27_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 64, 56, 56]> input_27_cast_fp16 = gelu(mode = input_27_mode_0, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_29_strides_0 = const()[name = tensor<string, []>("input_29_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_29_dilations_0 = const()[name = tensor<string, []>("input_29_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_29_groups_0 = const()[name = tensor<string, []>("input_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 64, 1, 1]> const_71_to_fp16 = const()[name = tensor<string, []>("const_71_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110784)))];
            tensor<fp16, [256]> const_72_to_fp16 = const()[name = tensor<string, []>("const_72_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(143616)))];
            tensor<fp16, [1, 256, 56, 56]> input_31_cast_fp16 = conv(bias = const_72_to_fp16, dilations = input_29_dilations_0, groups = input_29_groups_0, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = input_29_strides_0, weight = const_71_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<string, []> input_33_mode_0 = const()[name = tensor<string, []>("input_33_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 56, 56]> input_33_cast_fp16 = gelu(mode = input_33_mode_0, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<string, []> input_35_pad_type_0 = const()[name = tensor<string, []>("input_35_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_35_pad_0 = const()[name = tensor<string, []>("input_35_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_35_groups_0 = const()[name = tensor<string, []>("input_35_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [2]> input_35_strides_0 = const()[name = tensor<string, []>("input_35_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_35_dilations_0 = const()[name = tensor<string, []>("input_35_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [256, 1, 3, 3]> const_73_to_fp16 = const()[name = tensor<string, []>("const_73_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(144192)))];
            tensor<fp16, [256]> const_74_to_fp16 = const()[name = tensor<string, []>("const_74_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(148864)))];
            tensor<fp16, [1, 256, 56, 56]> input_37_cast_fp16 = conv(bias = const_74_to_fp16, dilations = input_35_dilations_0, groups = input_35_groups_0, pad = input_35_pad_0, pad_type = input_35_pad_type_0, strides = input_35_strides_0, weight = const_73_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<string, []> input_39_mode_0 = const()[name = tensor<string, []>("input_39_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 56, 56]> input_39_cast_fp16 = gelu(mode = input_39_mode_0, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_41_strides_0 = const()[name = tensor<string, []>("input_41_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_41_dilations_0 = const()[name = tensor<string, []>("input_41_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_41_groups_0 = const()[name = tensor<string, []>("input_41_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 256, 1, 1]> const_75_to_fp16 = const()[name = tensor<string, []>("const_75_to_fp16"), val = tensor<fp16, [64, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(149440)))];
            tensor<fp16, [64]> const_76_to_fp16 = const()[name = tensor<string, []>("const_76_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(182272)))];
            tensor<fp16, [1, 64, 56, 56]> x_3_cast_fp16 = conv(bias = const_76_to_fp16, dilations = input_41_dilations_0, groups = input_41_groups_0, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = input_41_strides_0, weight = const_75_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [1, 64, 56, 56]> input_43_cast_fp16 = add(x = x_3_cast_fp16, y = input_27_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<string, []> input_45_mode_0 = const()[name = tensor<string, []>("input_45_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 64, 56, 56]> input_45_cast_fp16 = gelu(mode = input_45_mode_0, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<string, []> input_47_pad_type_0 = const()[name = tensor<string, []>("input_47_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_47_strides_0 = const()[name = tensor<string, []>("input_47_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_47_pad_0 = const()[name = tensor<string, []>("input_47_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_47_dilations_0 = const()[name = tensor<string, []>("input_47_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_47_groups_0 = const()[name = tensor<string, []>("input_47_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 1, 1]> const_77_to_fp16 = const()[name = tensor<string, []>("const_77_to_fp16"), val = tensor<fp16, [128, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(182464)))];
            tensor<fp16, [128]> const_78_to_fp16 = const()[name = tensor<string, []>("const_78_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(198912)))];
            tensor<fp16, [1, 128, 56, 56]> input_49_cast_fp16 = conv(bias = const_78_to_fp16, dilations = input_47_dilations_0, groups = input_47_groups_0, pad = input_47_pad_0, pad_type = input_47_pad_type_0, strides = input_47_strides_0, weight = const_77_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<string, []> input_51_mode_0 = const()[name = tensor<string, []>("input_51_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 56, 56]> input_51_cast_fp16 = gelu(mode = input_51_mode_0, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<string, []> input_53_pad_type_0 = const()[name = tensor<string, []>("input_53_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_53_pad_0 = const()[name = tensor<string, []>("input_53_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_53_strides_0 = const()[name = tensor<string, []>("input_53_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> input_53_groups_0 = const()[name = tensor<string, []>("input_53_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> input_53_dilations_0 = const()[name = tensor<string, []>("input_53_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 1, 3, 3]> const_79_to_fp16 = const()[name = tensor<string, []>("const_79_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(199232)))];
            tensor<fp16, [128]> const_80_to_fp16 = const()[name = tensor<string, []>("const_80_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(201600)))];
            tensor<fp16, [1, 128, 28, 28]> input_55_cast_fp16 = conv(bias = const_80_to_fp16, dilations = input_53_dilations_0, groups = input_53_groups_0, pad = input_53_pad_0, pad_type = input_53_pad_type_0, strides = input_53_strides_0, weight = const_79_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<string, []> input_57_mode_0 = const()[name = tensor<string, []>("input_57_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 28, 28]> input_57_cast_fp16 = gelu(mode = input_57_mode_0, x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<string, []> input_59_pad_type_0 = const()[name = tensor<string, []>("input_59_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_59_strides_0 = const()[name = tensor<string, []>("input_59_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_59_pad_0 = const()[name = tensor<string, []>("input_59_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_59_dilations_0 = const()[name = tensor<string, []>("input_59_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_59_groups_0 = const()[name = tensor<string, []>("input_59_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> const_81_to_fp16 = const()[name = tensor<string, []>("const_81_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(201920)))];
            tensor<fp16, [128]> const_82_to_fp16 = const()[name = tensor<string, []>("const_82_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(234752)))];
            tensor<fp16, [1, 128, 28, 28]> x_5_cast_fp16 = conv(bias = const_82_to_fp16, dilations = input_59_dilations_0, groups = input_59_groups_0, pad = input_59_pad_0, pad_type = input_59_pad_type_0, strides = input_59_strides_0, weight = const_81_to_fp16, x = input_57_cast_fp16)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<int32, [4]> var_215 = const()[name = tensor<string, []>("op_215"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [4]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [4]>([4, 7, 4, 896])];
            tensor<fp16, [1, 28, 28, 128]> x_7_cast_fp16 = transpose(perm = var_215, x = x_5_cast_fp16)[name = tensor<string, []>("transpose_133")];
            tensor<fp16, [4, 7, 4, 896]> reshape_0_cast_fp16 = reshape(shape = reshape_0_shape_0, x = x_7_cast_fp16)[name = tensor<string, []>("reshape_0_cast_fp16")];
            tensor<int32, [4]> transpose_20_perm_0 = const()[name = tensor<string, []>("transpose_20_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [3]>([16, 49, 128])];
            tensor<fp16, [4, 4, 7, 896]> transpose_20_cast_fp16 = transpose(perm = transpose_20_perm_0, x = reshape_0_cast_fp16)[name = tensor<string, []>("transpose_132")];
            tensor<fp16, [16, 49, 128]> reshape_1_cast_fp16 = reshape(shape = reshape_1_shape_0, x = transpose_20_cast_fp16)[name = tensor<string, []>("reshape_1_cast_fp16")];
            tensor<int32, [1]> input_61_axes_0 = const()[name = tensor<string, []>("input_61_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [128]> model_stages_1_blocks_0_attn_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_attn_norm_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(235072)))];
            tensor<fp16, [128]> model_stages_1_blocks_0_attn_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_attn_norm_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(235392)))];
            tensor<fp16, []> var_62_to_fp16 = const()[name = tensor<string, []>("op_62_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [16, 49, 128]> input_61_cast_fp16 = layer_norm(axes = input_61_axes_0, beta = model_stages_1_blocks_0_attn_norm_bias_to_fp16, epsilon = var_62_to_fp16, gamma = model_stages_1_blocks_0_attn_norm_weight_to_fp16, x = reshape_1_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<fp16, [384, 128]> model_stages_1_blocks_0_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_attn_qkv_weight_to_fp16"), val = tensor<fp16, [384, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(235712)))];
            tensor<fp16, [384]> model_stages_1_blocks_0_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_attn_qkv_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(334080)))];
            tensor<fp16, [16, 49, 384]> linear_0_cast_fp16 = linear(bias = model_stages_1_blocks_0_attn_qkv_bias_to_fp16, weight = model_stages_1_blocks_0_attn_qkv_weight_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [4]> var_272 = const()[name = tensor<string, []>("op_272"), val = tensor<int32, [4]>([16, 49, 4, -1])];
            tensor<fp16, [16, 49, 4, 96]> var_273_cast_fp16 = reshape(shape = var_272, x = linear_0_cast_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<int32, [3]> var_274 = const()[name = tensor<string, []>("op_274"), val = tensor<int32, [3]>([32, 32, 32])];
            tensor<int32, []> var_275_axis_0 = const()[name = tensor<string, []>("op_275_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [16, 49, 4, 32]> var_275_cast_fp16_0, tensor<fp16, [16, 49, 4, 32]> var_275_cast_fp16_1, tensor<fp16, [16, 49, 4, 32]> var_275_cast_fp16_2 = split(axis = var_275_axis_0, split_sizes = var_274, x = var_273_cast_fp16)[name = tensor<string, []>("op_275_cast_fp16")];
            tensor<int32, [4]> var_283 = const()[name = tensor<string, []>("op_283"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_0_y_0_to_fp16 = const()[name = tensor<string, []>("mul_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [16, 49, 4, 32]> mul_0_cast_fp16 = mul(x = var_275_cast_fp16_0, y = mul_0_y_0_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_44_perm_0 = const()[name = tensor<string, []>("transpose_44_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_45_perm_0 = const()[name = tensor<string, []>("transpose_45_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [16, 4, 49, 32]> transpose_45 = transpose(perm = transpose_45_perm_0, x = var_275_cast_fp16_1)[name = tensor<string, []>("transpose_129")];
            tensor<fp16, [16, 4, 49, 32]> transpose_44 = transpose(perm = transpose_44_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_130")];
            tensor<fp16, [16, 4, 49, 49]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_44, y = transpose_45)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<fp16, [4, 49, 49]> attn_bias_1_to_fp16 = const()[name = tensor<string, []>("attn_bias_1_to_fp16"), val = tensor<fp16, [4, 49, 49]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(334912)))];
            tensor<fp16, [16, 4, 49, 49]> add_0_cast_fp16 = add(x = matmul_0_cast_fp16, y = attn_bias_1_to_fp16)[name = tensor<string, []>("add_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [16, 4, 49, 49]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = add_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> x_11_transpose_x_0 = const()[name = tensor<string, []>("x_11_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_11_transpose_y_0 = const()[name = tensor<string, []>("x_11_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 4, 49, 32]> v_3_cast_fp16 = transpose(perm = var_283, x = var_275_cast_fp16_2)[name = tensor<string, []>("transpose_131")];
            tensor<fp16, [16, 4, 49, 32]> x_11_cast_fp16 = matmul(transpose_x = x_11_transpose_x_0, transpose_y = x_11_transpose_y_0, x = softmax_0_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<int32, [4]> var_286_perm_0 = const()[name = tensor<string, []>("op_286_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_287 = const()[name = tensor<string, []>("op_287"), val = tensor<int32, [3]>([16, 49, 128])];
            tensor<fp16, [16, 49, 4, 32]> var_286_cast_fp16 = transpose(perm = var_286_perm_0, x = x_11_cast_fp16)[name = tensor<string, []>("transpose_128")];
            tensor<fp16, [16, 49, 128]> input_63_cast_fp16 = reshape(shape = var_287, x = var_286_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<fp16, [128, 128]> model_stages_1_blocks_0_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_attn_proj_weight_to_fp16"), val = tensor<fp16, [128, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(354240)))];
            tensor<fp16, [128]> model_stages_1_blocks_0_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_attn_proj_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(387072)))];
            tensor<fp16, [16, 49, 128]> linear_1_cast_fp16 = linear(bias = model_stages_1_blocks_0_attn_proj_bias_to_fp16, weight = model_stages_1_blocks_0_attn_proj_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [4]> reshape_2_shape_0 = const()[name = tensor<string, []>("reshape_2_shape_0"), val = tensor<int32, [4]>([4, 4, 7, 896])];
            tensor<fp16, [4, 4, 7, 896]> reshape_2_cast_fp16 = reshape(shape = reshape_2_shape_0, x = linear_1_cast_fp16)[name = tensor<string, []>("reshape_2_cast_fp16")];
            tensor<int32, [4]> transpose_21_perm_0 = const()[name = tensor<string, []>("transpose_21_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> reshape_3_shape_0 = const()[name = tensor<string, []>("reshape_3_shape_0"), val = tensor<int32, [4]>([1, 28, 28, 128])];
            tensor<fp16, [4, 7, 4, 896]> transpose_21_cast_fp16 = transpose(perm = transpose_21_perm_0, x = reshape_2_cast_fp16)[name = tensor<string, []>("transpose_127")];
            tensor<fp16, [1, 28, 28, 128]> reshape_3_cast_fp16 = reshape(shape = reshape_3_shape_0, x = transpose_21_cast_fp16)[name = tensor<string, []>("reshape_3_cast_fp16")];
            tensor<fp16, [1, 28, 28, 128]> x_17_cast_fp16 = add(x = x_7_cast_fp16, y = reshape_3_cast_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<int32, [4]> var_298 = const()[name = tensor<string, []>("op_298"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> input_67_pad_type_0 = const()[name = tensor<string, []>("input_67_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_67_pad_0 = const()[name = tensor<string, []>("input_67_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_67_groups_0 = const()[name = tensor<string, []>("input_67_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> input_67_strides_0 = const()[name = tensor<string, []>("input_67_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_67_dilations_0 = const()[name = tensor<string, []>("input_67_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 1, 3, 3]> const_83_to_fp16 = const()[name = tensor<string, []>("const_83_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(387392)))];
            tensor<fp16, [128]> const_84_to_fp16 = const()[name = tensor<string, []>("const_84_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(389760)))];
            tensor<fp16, [1, 128, 28, 28]> input_65_cast_fp16 = transpose(perm = var_298, x = x_17_cast_fp16)[name = tensor<string, []>("transpose_126")];
            tensor<fp16, [1, 128, 28, 28]> x_19_cast_fp16 = conv(bias = const_84_to_fp16, dilations = input_67_dilations_0, groups = input_67_groups_0, pad = input_67_pad_0, pad_type = input_67_pad_type_0, strides = input_67_strides_0, weight = const_83_to_fp16, x = input_65_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<int32, [3]> var_313 = const()[name = tensor<string, []>("op_313"), val = tensor<int32, [3]>([1, 128, 784])];
            tensor<fp16, [1, 128, 784]> var_314_cast_fp16 = reshape(shape = var_313, x = x_19_cast_fp16)[name = tensor<string, []>("op_314_cast_fp16")];
            tensor<int32, [3]> input_69_perm_0 = const()[name = tensor<string, []>("input_69_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> input_71_axes_0 = const()[name = tensor<string, []>("input_71_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [128]> model_stages_1_blocks_0_mlp_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_mlp_norm_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(390080)))];
            tensor<fp16, [128]> model_stages_1_blocks_0_mlp_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_mlp_norm_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(390400)))];
            tensor<fp16, [1, 784, 128]> input_69_cast_fp16 = transpose(perm = input_69_perm_0, x = var_314_cast_fp16)[name = tensor<string, []>("transpose_125")];
            tensor<fp16, [1, 784, 128]> input_71_cast_fp16 = layer_norm(axes = input_71_axes_0, beta = model_stages_1_blocks_0_mlp_norm_bias_to_fp16, epsilon = var_62_to_fp16, gamma = model_stages_1_blocks_0_mlp_norm_weight_to_fp16, x = input_69_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<fp16, [512, 128]> model_stages_1_blocks_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [512, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(390720)))];
            tensor<fp16, [512]> model_stages_1_blocks_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(521856)))];
            tensor<fp16, [1, 784, 512]> linear_2_cast_fp16 = linear(bias = model_stages_1_blocks_0_mlp_fc1_bias_to_fp16, weight = model_stages_1_blocks_0_mlp_fc1_weight_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<string, []> input_75_mode_0 = const()[name = tensor<string, []>("input_75_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 784, 512]> input_75_cast_fp16 = gelu(mode = input_75_mode_0, x = linear_2_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<fp16, [128, 512]> model_stages_1_blocks_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [128, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(522944)))];
            tensor<fp16, [128]> model_stages_1_blocks_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(654080)))];
            tensor<fp16, [1, 784, 128]> linear_3_cast_fp16 = linear(bias = model_stages_1_blocks_0_mlp_fc2_bias_to_fp16, weight = model_stages_1_blocks_0_mlp_fc2_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 784, 128]> x_21_cast_fp16 = add(x = input_69_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<int32, [4]> var_333 = const()[name = tensor<string, []>("op_333"), val = tensor<int32, [4]>([1, 28, 28, 128])];
            tensor<fp16, [1, 28, 28, 128]> x_23_cast_fp16 = reshape(shape = var_333, x = x_21_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<int32, [4]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [4]>([4, 7, 4, 896])];
            tensor<fp16, [4, 7, 4, 896]> reshape_4_cast_fp16 = reshape(shape = reshape_4_shape_0, x = x_23_cast_fp16)[name = tensor<string, []>("reshape_4_cast_fp16")];
            tensor<int32, [4]> transpose_22_perm_0 = const()[name = tensor<string, []>("transpose_22_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [3]>([16, 49, 128])];
            tensor<fp16, [4, 4, 7, 896]> transpose_22_cast_fp16 = transpose(perm = transpose_22_perm_0, x = reshape_4_cast_fp16)[name = tensor<string, []>("transpose_124")];
            tensor<fp16, [16, 49, 128]> reshape_5_cast_fp16 = reshape(shape = reshape_5_shape_0, x = transpose_22_cast_fp16)[name = tensor<string, []>("reshape_5_cast_fp16")];
            tensor<int32, [1]> input_81_axes_0 = const()[name = tensor<string, []>("input_81_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [128]> model_stages_1_blocks_1_attn_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_1_attn_norm_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(654400)))];
            tensor<fp16, [128]> model_stages_1_blocks_1_attn_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_1_attn_norm_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(654720)))];
            tensor<fp16, [16, 49, 128]> input_81_cast_fp16 = layer_norm(axes = input_81_axes_0, beta = model_stages_1_blocks_1_attn_norm_bias_to_fp16, epsilon = var_62_to_fp16, gamma = model_stages_1_blocks_1_attn_norm_weight_to_fp16, x = reshape_5_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, [384, 128]> model_stages_1_blocks_1_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_1_attn_qkv_weight_to_fp16"), val = tensor<fp16, [384, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(655040)))];
            tensor<fp16, [384]> model_stages_1_blocks_1_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_1_attn_qkv_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(753408)))];
            tensor<fp16, [16, 49, 384]> linear_4_cast_fp16 = linear(bias = model_stages_1_blocks_1_attn_qkv_bias_to_fp16, weight = model_stages_1_blocks_1_attn_qkv_weight_to_fp16, x = input_81_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [4]> var_388 = const()[name = tensor<string, []>("op_388"), val = tensor<int32, [4]>([16, 49, 4, -1])];
            tensor<fp16, [16, 49, 4, 96]> var_389_cast_fp16 = reshape(shape = var_388, x = linear_4_cast_fp16)[name = tensor<string, []>("op_389_cast_fp16")];
            tensor<int32, [3]> var_390 = const()[name = tensor<string, []>("op_390"), val = tensor<int32, [3]>([32, 32, 32])];
            tensor<int32, []> var_391_axis_0 = const()[name = tensor<string, []>("op_391_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [16, 49, 4, 32]> var_391_cast_fp16_0, tensor<fp16, [16, 49, 4, 32]> var_391_cast_fp16_1, tensor<fp16, [16, 49, 4, 32]> var_391_cast_fp16_2 = split(axis = var_391_axis_0, split_sizes = var_390, x = var_389_cast_fp16)[name = tensor<string, []>("op_391_cast_fp16")];
            tensor<int32, [4]> var_399 = const()[name = tensor<string, []>("op_399"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_1_y_0_to_fp16 = const()[name = tensor<string, []>("mul_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [16, 49, 4, 32]> mul_1_cast_fp16 = mul(x = var_391_cast_fp16_0, y = mul_1_y_0_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_46_perm_0 = const()[name = tensor<string, []>("transpose_46_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_47_perm_0 = const()[name = tensor<string, []>("transpose_47_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [16, 4, 49, 32]> transpose_47 = transpose(perm = transpose_47_perm_0, x = var_391_cast_fp16_1)[name = tensor<string, []>("transpose_121")];
            tensor<fp16, [16, 4, 49, 32]> transpose_46 = transpose(perm = transpose_46_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_122")];
            tensor<fp16, [16, 4, 49, 49]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_46, y = transpose_47)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<fp16, [4, 49, 49]> attn_bias_3_to_fp16 = const()[name = tensor<string, []>("attn_bias_3_to_fp16"), val = tensor<fp16, [4, 49, 49]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(754240)))];
            tensor<fp16, [16, 4, 49, 49]> add_1_cast_fp16 = add(x = matmul_1_cast_fp16, y = attn_bias_3_to_fp16)[name = tensor<string, []>("add_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [16, 4, 49, 49]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = add_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> x_27_transpose_x_0 = const()[name = tensor<string, []>("x_27_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_27_transpose_y_0 = const()[name = tensor<string, []>("x_27_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 4, 49, 32]> v_7_cast_fp16 = transpose(perm = var_399, x = var_391_cast_fp16_2)[name = tensor<string, []>("transpose_123")];
            tensor<fp16, [16, 4, 49, 32]> x_27_cast_fp16 = matmul(transpose_x = x_27_transpose_x_0, transpose_y = x_27_transpose_y_0, x = softmax_1_cast_fp16, y = v_7_cast_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<int32, [4]> var_402_perm_0 = const()[name = tensor<string, []>("op_402_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_403 = const()[name = tensor<string, []>("op_403"), val = tensor<int32, [3]>([16, 49, 128])];
            tensor<fp16, [16, 49, 4, 32]> var_402_cast_fp16 = transpose(perm = var_402_perm_0, x = x_27_cast_fp16)[name = tensor<string, []>("transpose_120")];
            tensor<fp16, [16, 49, 128]> input_83_cast_fp16 = reshape(shape = var_403, x = var_402_cast_fp16)[name = tensor<string, []>("input_83_cast_fp16")];
            tensor<fp16, [128, 128]> model_stages_1_blocks_1_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_1_attn_proj_weight_to_fp16"), val = tensor<fp16, [128, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(773568)))];
            tensor<fp16, [128]> model_stages_1_blocks_1_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_1_attn_proj_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(806400)))];
            tensor<fp16, [16, 49, 128]> linear_5_cast_fp16 = linear(bias = model_stages_1_blocks_1_attn_proj_bias_to_fp16, weight = model_stages_1_blocks_1_attn_proj_weight_to_fp16, x = input_83_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<int32, [4]> reshape_6_shape_0 = const()[name = tensor<string, []>("reshape_6_shape_0"), val = tensor<int32, [4]>([4, 4, 7, 896])];
            tensor<fp16, [4, 4, 7, 896]> reshape_6_cast_fp16 = reshape(shape = reshape_6_shape_0, x = linear_5_cast_fp16)[name = tensor<string, []>("reshape_6_cast_fp16")];
            tensor<int32, [4]> transpose_23_perm_0 = const()[name = tensor<string, []>("transpose_23_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> reshape_7_shape_0 = const()[name = tensor<string, []>("reshape_7_shape_0"), val = tensor<int32, [4]>([1, 28, 28, 128])];
            tensor<fp16, [4, 7, 4, 896]> transpose_23_cast_fp16 = transpose(perm = transpose_23_perm_0, x = reshape_6_cast_fp16)[name = tensor<string, []>("transpose_119")];
            tensor<fp16, [1, 28, 28, 128]> reshape_7_cast_fp16 = reshape(shape = reshape_7_shape_0, x = transpose_23_cast_fp16)[name = tensor<string, []>("reshape_7_cast_fp16")];
            tensor<fp16, [1, 28, 28, 128]> x_33_cast_fp16 = add(x = x_23_cast_fp16, y = reshape_7_cast_fp16)[name = tensor<string, []>("x_33_cast_fp16")];
            tensor<int32, [4]> var_414 = const()[name = tensor<string, []>("op_414"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> input_87_pad_type_0 = const()[name = tensor<string, []>("input_87_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_87_pad_0 = const()[name = tensor<string, []>("input_87_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_87_groups_0 = const()[name = tensor<string, []>("input_87_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> input_87_strides_0 = const()[name = tensor<string, []>("input_87_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_87_dilations_0 = const()[name = tensor<string, []>("input_87_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 1, 3, 3]> const_85_to_fp16 = const()[name = tensor<string, []>("const_85_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(806720)))];
            tensor<fp16, [128]> const_86_to_fp16 = const()[name = tensor<string, []>("const_86_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(809088)))];
            tensor<fp16, [1, 128, 28, 28]> input_85_cast_fp16 = transpose(perm = var_414, x = x_33_cast_fp16)[name = tensor<string, []>("transpose_118")];
            tensor<fp16, [1, 128, 28, 28]> x_35_cast_fp16 = conv(bias = const_86_to_fp16, dilations = input_87_dilations_0, groups = input_87_groups_0, pad = input_87_pad_0, pad_type = input_87_pad_type_0, strides = input_87_strides_0, weight = const_85_to_fp16, x = input_85_cast_fp16)[name = tensor<string, []>("x_35_cast_fp16")];
            tensor<int32, [3]> var_429 = const()[name = tensor<string, []>("op_429"), val = tensor<int32, [3]>([1, 128, 784])];
            tensor<fp16, [1, 128, 784]> var_430_cast_fp16 = reshape(shape = var_429, x = x_35_cast_fp16)[name = tensor<string, []>("op_430_cast_fp16")];
            tensor<int32, [3]> input_89_perm_0 = const()[name = tensor<string, []>("input_89_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> input_91_axes_0 = const()[name = tensor<string, []>("input_91_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [128]> model_stages_1_blocks_1_mlp_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_1_mlp_norm_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(809408)))];
            tensor<fp16, [128]> model_stages_1_blocks_1_mlp_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_stages_1_blocks_1_mlp_norm_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(809728)))];
            tensor<fp16, [1, 784, 128]> input_89_cast_fp16 = transpose(perm = input_89_perm_0, x = var_430_cast_fp16)[name = tensor<string, []>("transpose_117")];
            tensor<fp16, [1, 784, 128]> input_91_cast_fp16 = layer_norm(axes = input_91_axes_0, beta = model_stages_1_blocks_1_mlp_norm_bias_to_fp16, epsilon = var_62_to_fp16, gamma = model_stages_1_blocks_1_mlp_norm_weight_to_fp16, x = input_89_cast_fp16)[name = tensor<string, []>("input_91_cast_fp16")];
